package org.example;

public class Main {
    public static void main(String[] args) {
    // Lesson 15
    // Необходимо написать автотесты для сайта mts.by.
    // Суть тестов заключается в проверке блока «Онлайн пополнение без комиссии»:
    // 1. Проверить название указанного блока;
    // 2. Проверить наличие логотипов платёжных систем;
    // 3. Проверить работу ссылки «Подробнее о сервисе»;
    // 4. Заполнить поля и проверить работу кнопки
    // «Продолжить» (проверяем только вариант «Услуги связи», номер для теста 297777777)
    // Lesson 16
    // Продолжим работу над блоком «Онлайн пополнение без комиссии» сайта mts.by.
    // Перевести ранее написанный тест на использование паттерна PageObject и добавить следующие проверки:
    // 1. Проверить надписи в незаполненных полях каждого варианта оплаты услуг:
    // услуги связи, домашний интернет, рассрочка, задолженность;
    // 2. Для варианта «Услуги связи» заполнить поля в
    // соответствии с пререквизитами из предыдущей темы, нажать кнопку «Продолжить»
    // и в появившемся окне проверить корректность отображения суммы (в том числе на кнопке),
    // номера телефона, а также надписей в незаполненных полях для ввода реквизитов карты,
    // наличие иконок платёжных систем.
    }
}